<details ><summary>plan for talos-bootstrap 2025-07-19 22:03:42 (UTC)</summary>
      <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #72
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"] will be destroyed
  # (because key ["atuan"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "atuan" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "havnor"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "selidor"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["controlplane-3"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "gont"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["gont"] will be destroyed
  # (because key ["gont"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "gont" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] will be destroyed
  # (because key ["havnor"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "havnor" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["selidor"] will be destroyed
  # (because key ["selidor"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "selidor" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["worker-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "atuan"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["worker-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "atuan"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.50",
            ],
          - [],
          - [
              - "10.244.2.221",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe7c:cce6",
            ],
          - [
              - "fe80::8cc6:b2ff:fe3d:9515",
            ],
          - [
              - "fe80::3057:8fff:fe26:a275",
            ],
          - [
              - "fe80::8eb:50ff:fec4:8115",
            ],
          - [
              - "fe80::b804:a6ff:feb5:4071",
            ],
          - [
              - "fe80::1ce5:dbff:fec5:b9b",
            ],
          - [
              - "fe80::3c49:86ff:fefb:163b",
            ],
          - [
              - "fe80::f8de:d9ff:fea6:80bc",
            ],
          - [
              - "fe80::60a5:9aff:fe9f:5356",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "C6:13:BB:8D:1E:39",
          - "9E:D4:BE:34:E2:AD",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:7C:CC:E6",
          - "8E:C6:B2:3D:95:15",
          - "32:57:8F:26:A2:75",
          - "0A:EB:50:C4:81:15",
          - "BA:04:A6:B5:40:71",
          - "1E:E5:DB:C5:0B:9B",
          - "3E:49:86:FB:16:3B",
          - "FA:DE:D9:A6:80:BC",
          - "62:A5:9A:9F:53:56",
        ] -> (known after apply)
        name                    = "talos-controlplane"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxcc87902087084",
          - "lxc862afe21551a",
          - "lxc7ff4a5c05d4d",
          - "lxc7b9d5530d79a",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 100 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:7C:CC:E6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "104" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.53",
            ],
          - [],
          - [
              - "10.244.4.70",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:feaf:4c4e",
            ],
          - [
              - "fe80::4c72:21ff:fe5b:c3ee",
            ],
          - [
              - "fe80::d490:68ff:fe7c:7152",
            ],
          - [
              - "fe80::7ca6:5fff:fe1a:b567",
            ],
          - [
              - "fe80::9822:6cff:fe2c:b25b",
            ],
          - [
              - "fe80::4030:f9ff:fe69:cee7",
            ],
          - [
              - "fe80::2471:9dff:fe74:6685",
            ],
          - [
              - "fe80::c4ad:8aff:fe4b:bad9",
            ],
          - [
              - "fe80::d8d8:d6ff:fe96:3cb7",
            ],
          - [
              - "fe80::8414:d4ff:fea1:aac7",
            ],
          - [
              - "fe80::c4a8:b1ff:fea6:a44",
            ],
          - [
              - "fe80::14f6:73ff:fec8:9820",
            ],
          - [
              - "fe80::3485:2fff:fe90:e75b",
            ],
          - [
              - "fe80::ac7d:c9ff:fee8:7677",
            ],
          - [
              - "fe80::8001:c0ff:fe8f:d1c1",
            ],
          - [
              - "fe80::4cdd:72ff:fecc:454e",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "DE:3C:47:56:0D:21",
          - "D6:C4:FC:38:37:BB",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:AF:4C:4E",
          - "4E:72:21:5B:C3:EE",
          - "D6:90:68:7C:71:52",
          - "7E:A6:5F:1A:B5:67",
          - "9A:22:6C:2C:B2:5B",
          - "42:30:F9:69:CE:E7",
          - "26:71:9D:74:66:85",
          - "C6:AD:8A:4B:BA:D9",
          - "DA:D8:D6:96:3C:B7",
          - "86:14:D4:A1:AA:C7",
          - "C6:A8:B1:A6:0A:44",
          - "16:F6:73:C8:98:20",
          - "36:85:2F:90:E7:5B",
          - "AE:7D:C9:E8:76:77",
          - "82:01:C0:8F:D1:C1",
          - "4E:DD:72:CC:45:4E",
        ] -> (known after apply)
        name                    = "talos-controlplane-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc4515bb7c9476",
          - "lxc9c036ffbbdd1",
          - "lxc8335c09a4a49",
          - "lxcb513458e2d09",
          - "lxc02f591623593",
          - "lxca3b371ac0ba9",
          - "lxce4d80b6e9507",
          - "lxc0903d8e4ab8e",
          - "lxccb47c112d8e1",
          - "lxc9dcf330b408e",
          - "lxcdb94a41e2d71",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 104 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-104-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:AF:4C:4E" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-3"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "103" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.54",
            ],
          - [],
          - [
              - "10.244.3.141",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed5:a6",
            ],
          - [
              - "fe80::c420:c7ff:feaa:686f",
            ],
          - [
              - "fe80::587c:44ff:fe68:e941",
            ],
          - [
              - "fe80::8c18:a0ff:fe2d:1b34",
            ],
          - [
              - "fe80::a4f2:bff:fe83:fc3b",
            ],
          - [
              - "fe80::94d0:15ff:fec0:d52a",
            ],
          - [
              - "fe80::4446:21ff:fe6b:54dd",
            ],
          - [
              - "fe80::7c92:16ff:fe42:9c8a",
            ],
          - [
              - "fe80::c8a4:deff:fe97:67e6",
            ],
          - [
              - "fe80::54e1:e6ff:fe83:8732",
            ],
          - [
              - "fe80::1c2b:9aff:febd:64b0",
            ],
          - [
              - "fe80::54e2:eeff:fedc:78a6",
            ],
          - [
              - "fe80::6032:9fff:fe9c:6fdb",
            ],
          - [
              - "fe80::b4ab:53ff:fe18:8df2",
            ],
          - [
              - "fe80::586f:b9ff:fedd:68e0",
            ],
          - [
              - "fe80::dcdb:aaff:fe5d:5620",
            ],
          - [
              - "fe80::7050:94ff:feb2:483a",
            ],
          - [
              - "fe80::b8d2:5bff:fe98:39bc",
            ],
          - [
              - "fe80::20f2:9bff:fe47:648b",
            ],
          - [
              - "fe80::3c16:4aff:fe58:c4d1",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "CA:0F:E7:8C:9F:2E",
          - "F6:B9:FA:F4:8B:13",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D5:00:A6",
          - "C6:20:C7:AA:68:6F",
          - "5A:7C:44:68:E9:41",
          - "8E:18:A0:2D:1B:34",
          - "A6:F2:0B:83:FC:3B",
          - "96:D0:15:C0:D5:2A",
          - "46:46:21:6B:54:DD",
          - "7E:92:16:42:9C:8A",
          - "CA:A4:DE:97:67:E6",
          - "56:E1:E6:83:87:32",
          - "1E:2B:9A:BD:64:B0",
          - "56:E2:EE:DC:78:A6",
          - "62:32:9F:9C:6F:DB",
          - "B6:AB:53:18:8D:F2",
          - "5A:6F:B9:DD:68:E0",
          - "DE:DB:AA:5D:56:20",
          - "72:50:94:B2:48:3A",
          - "BA:D2:5B:98:39:BC",
          - "22:F2:9B:47:64:8B",
          - "3E:16:4A:58:C4:D1",
        ] -> (known after apply)
        name                    = "talos-controlplane-3"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc6dc0e327d339",
          - "lxcd9d9a50f82e7",
          - "lxc8d34ebb6788d",
          - "lxcfc6e050c4b81",
          - "lxcf92afb9558e8",
          - "lxc87b3b94b0af4",
          - "lxc31726f959884",
          - "lxcde33286e4582",
          - "lxca9e96b991550",
          - "lxc0caed253e0f8",
          - "lxc2267c4e9ace9",
          - "lxcd0ba61d3b3eb",
          - "lxc7afa1121390c",
          - "lxc179f948c1859",
          - "lxc793ee3ec6491",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 103 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-103-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D5:00:A6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-1"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "101" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.51",
            ],
          - [],
          - [
              - "10.244.0.237",
            ],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe6f:15b6",
            ],
          - [
              - "fe80::1055:ebff:feec:594",
            ],
          - [
              - "fe80::e058:8bff:feff:13e5",
            ],
          - [
              - "fe80::c492:7fff:fe0e:a864",
            ],
          - [
              - "fe80::7823:8eff:fe1e:cea5",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "AE:48:B1:F2:AD:04",
          - "FE:20:C7:0C:46:D3",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:6F:15:B6",
          - "12:55:EB:EC:05:94",
          - "E2:58:8B:FF:13:E5",
          - "C6:92:7F:0E:A8:64",
          - "7A:23:8E:1E:CE:A5",
        ] -> (known after apply)
        name                    = "talos-worker-1"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 101 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-101-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:6F:15:B6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "102" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.52",
            ],
          - [],
          - [
              - "10.244.1.28",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe45:f407",
            ],
          - [
              - "fe80::1822:69ff:fe22:32ff",
            ],
          - [
              - "fe80::e0b0:f6ff:fe46:ec03",
            ],
          - [
              - "fe80::d002:4bff:fed8:3651",
            ],
          - [
              - "fe80::9c97:efff:fe46:2552",
            ],
          - [
              - "fe80::34b2:21ff:fed7:bb09",
            ],
          - [
              - "fe80::6cff:55ff:fe3a:b6fa",
            ],
          - [
              - "fe80::d029:c0ff:fed2:8329",
            ],
          - [
              - "fe80::4c2e:65ff:fe70:43c",
            ],
          - [
              - "fe80::2885:30ff:fe65:2cf6",
            ],
          - [
              - "fe80::48e9:fdff:fef1:4750",
            ],
          - [
              - "fe80::f803:ecff:fe04:80a6",
            ],
          - [
              - "fe80::6412:3eff:fef0:66f0",
            ],
          - [
              - "fe80::f8bd:c5ff:feae:a9b4",
            ],
          - [
              - "fe80::a8c8:c5ff:fe02:559e",
            ],
          - [
              - "fe80::83f:6cff:fe63:43ff",
            ],
          - [
              - "fe80::1492:c9ff:fe69:2d3f",
            ],
          - [
              - "fe80::b030:48ff:fefd:58de",
            ],
          - [
              - "fe80::e842:bcff:fe54:e962",
            ],
          - [
              - "fe80::74f5:5aff:fe4a:635b",
            ],
          - [
              - "fe80::2cb2:2cff:fee5:28b6",
            ],
          - [
              - "fe80::5c98:f1ff:fe62:6403",
            ],
          - [
              - "fe80::a402:feff:fe87:936e",
            ],
          - [
              - "fe80::c6e:1fff:fe10:662d",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "5E:ED:12:E1:0E:0C",
          - "42:70:0C:52:B8:AF",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:45:F4:07",
          - "1A:22:69:22:32:FF",
          - "E2:B0:F6:46:EC:03",
          - "D2:02:4B:D8:36:51",
          - "9E:97:EF:46:25:52",
          - "36:B2:21:D7:BB:09",
          - "6E:FF:55:3A:B6:FA",
          - "D2:29:C0:D2:83:29",
          - "4E:2E:65:70:04:3C",
          - "2A:85:30:65:2C:F6",
          - "4A:E9:FD:F1:47:50",
          - "FA:03:EC:04:80:A6",
          - "66:12:3E:F0:66:F0",
          - "FA:BD:C5:AE:A9:B4",
          - "AA:C8:C5:02:55:9E",
          - "0A:3F:6C:63:43:FF",
          - "16:92:C9:69:2D:3F",
          - "B2:30:48:FD:58:DE",
          - "EA:42:BC:54:E9:62",
          - "76:F5:5A:4A:63:5B",
          - "2E:B2:2C:E5:28:B6",
          - "5E:98:F1:62:64:03",
          - "A6:02:FE:87:93:6E",
          - "0E:6E:1F:10:66:2D",
        ] -> (known after apply)
        name                    = "talos-worker-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc6de540fe272d",
          - "lxc076797cbec96",
          - "lxce4332b4603b6",
          - "lxc6410402f7cdf",
          - "lxc58727890e1a9",
          - "lxc3a55ad4b002b",
          - "lxc94a641c23937",
          - "lxc286dfc86969e",
          - "lxc716084e042ec",
          - "lxcd3355b6d7824",
          - "lxc4db3699fe660",
          - "lxcb354b4496c92",
          - "lxcfedf17cf986c",
          - "lxc9f99d8290bf5",
          - "lxc168f7e8a4277",
          - "lxce83b47ae8b42",
          - "lxc6c0a8a221a25",
          - "lxc88d067276308",
          - "lxc8d7e2ce36932",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 102 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-102-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:45:F4:07" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 10 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (talos-bootstrap)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>